# --------------------------
# Некоторые теоретические выкладки
# --------------------------
# y_1* ~ b_10 + b_11 * x_11 + b_12 * x_12 + b_13 * x_13
# y_2* ~ b_20 + b_21 * x_21 + b_22 * x_22 + b_23 * x_23
# y_3* ~ b_30 + b_31 * x_31 + b_32 * x_32 + b_33 * x_33

# Индивид выбирает одну из трех альтернатив:
# y = 1, if y_1* > y_2* & y_1* > y_3*
# y = 2, if y_2* > y_1* & y_2* > y_3*
# y = 3, if y_3* > y_1* & y_3* > y_2*

# Предположение: ошибки имеют многомерное нормальное распределение:
#
#       |e_1i|     ||0|  |σ_1^2           ρ_{12}*σ_1*σ_2  ρ_{13}*σ_1*σ_2||
# e_i = |e_2i| ~ N ||0|, |ρ_{12}*σ_1*σ_2  σ_2^2           ρ_{23}*σ_2*σ_3||
#       |e_3i|     ||0|  |ρ_{13}*σ_1*σ_3  ρ_{23}*σ_2*σ_3  σ_3^2         ||
#
# Полагаем y_3* = 0 и σ_1^2 = 1:
#
#       |e_1i|     ||0|  |1           ρ_{12}*σ_2||
# e_i = |    | ~ N || |, |                      ||
#       |e_2i|     ||0|  |ρ_{12}*σ_2  σ_2^2     ||
